tap "artginzburg/tap", "https://github.com/Homebrew/brew"
tap "charmbracelet/tap"
tap "coder/coder", "https://github.com/Homebrew/brew"
tap "daytonaio/cli"
tap "deepsourcelabs/cli"
tap "determined-ai/determined"
tap "felixkratz/formulae"
tap "ggozad/formulas"
tap "hashicorp/tap"
tap "heroku/brew", "https://github.com/Homebrew/brew"
tap "homebrew/command-not-found"
tap "localstack/tap"
tap "macos-fuse-t/cask", "https://github.com/Homebrew/brew"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "nikitabobko/tap", "https://github.com/Homebrew/brew"
tap "nitrictech/tap"
tap "oven-sh/bun", "https://github.com/Homebrew/brew"
tap "redis-stack/redis-stack"
tap "sourcegraph/src-cli"
tap "spectralops/tap", "https://github.com/Homebrew/brew"
tap "supabase/tap"
tap "tabbyml/tabby", "https://github.com/Homebrew/brew"
tap "terrastruct/tap", "https://github.com/Homebrew/brew"
tap "yakitrak/yakitrak"
brew "abseil"
brew "act"
brew "amp"
brew "xz"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "apr-util"
brew "argc"
brew "arp-scan"
brew "autoconf"
brew "autoenv"
brew "python@3.12"
brew "autojump"
brew "automake"
brew "gettext"
brew "glib"
brew "harfbuzz"
brew "ballerina"
brew "bfg"
brew "bison"
brew "btop"
brew "caddy"
brew "python@3.13"
brew "certbot"
brew "libyaml"
brew "cfn-lint"
brew "chroma"
brew "chruby"
brew "cliclick"
brew "cloudflared", restart_service: :changed
brew "cmake"
brew "cmatrix"
brew "code-server"
brew "commitizen"
brew "gmp"
brew "coreutils"
brew "ctop"
brew "curlie"
brew "node"
brew "czg"
brew "d2"
brew "ddgr"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-credential-helper"
brew "espeak-ng"
brew "exiftool"
brew "eza"
brew "fdupes"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libass"
brew "pango"
brew "sdl2"
brew "tesseract"
brew "ffmpeg"
brew "flyctl"
brew "freetds"
brew "fzf"
brew "gcc@12"
brew "gdbm"
brew "gh"
brew "git"
brew "git-lfs"
brew "gitui"
brew "glow"
brew "gnupg"
brew "go"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "grpc"
brew "pkgconf"
brew "guile"
brew "helm"
brew "htop"
brew "httpie"
brew "httpx"
brew "httrack"
brew "huggingface-cli"
brew "imagemagick"
brew "infracost"
brew "jq"
brew "just"
brew "k6"
brew "kind"
brew "kubernetes-cli"
brew "lefthook"
brew "libffi"
brew "livekit"
brew "livekit-cli"
brew "llama.cpp"
brew "lld"
brew "llm"
brew "lolcat"
brew "lowdown"
brew "lychee"
brew "make"
brew "micro"
brew "mintoolkit"
brew "mkcert"
brew "mongosh"
brew "mosh"
brew "mpv"
brew "ncdu"
brew "neonctl"
brew "neovim"
brew "nushell"
brew "oh-my-posh"
brew "php"
brew "pieces-cli", link: false
brew "pipenv"
brew "pipx"
brew "portaudio"
brew "postgresql@14", restart_service: :changed
brew "postgresql@16", restart_service: :changed
brew "pre-commit"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "pyenv"
brew "python@3.11"
brew "redis", restart_service: :changed
brew "ruby-install"
brew "ruff"
brew "runme"
brew "sampler"
brew "semgrep", link: false
brew "shellcheck"
brew "shfmt"
brew "snap"
brew "ssh3"
brew "stellar-cli"
brew "superfile"
brew "tcl-tk"
brew "temporal"
brew "tmux"
brew "trafilatura"
brew "tree"
brew "trivy"
brew "uv"
brew "wget"
brew "xdotool"
brew "yamllint"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-syntax-highlighting"
brew "artginzburg/tap/sudo-touchid"
brew "charmbracelet/tap/skate"
brew "coder/coder/coder"
brew "daytonaio/cli/daytona"
brew "deepsourcelabs/cli/deepsource"
brew "determined-ai/determined/determined-master"
brew "felixkratz/formulae/sketchybar"
brew "ggozad/formulas/oterm"
brew "hashicorp/tap/terraform"
brew "heroku/brew/heroku"
brew "localstack/tap/localstack-cli"
brew "mongodb/brew/mongodb-community"
brew "nitrictech/tap/nitric"
brew "oven-sh/bun/bun"
brew "sourcegraph/src-cli/src-cli"
brew "spectralops/tap/spectral"
brew "supabase/tap/supabase"
brew "terrastruct/tap/tala"
brew "yakitrak/yakitrak/obsidian-cli"
cask "aerospace"
cask "block-goose"
cask "font-hack-nerd-font"
cask "fuse-t"
cask "fuse-t-sshfs"
cask "git-credential-manager"
cask "jordanbaird-ice"
cask "macfuse"
cask "ngrok"
cask "pieces-cli"
cask "redis-stack"
cask "redis-stack-redisinsight"
cask "redis-stack-server"
cask "stats"
cask "temurin"
vscode "13xforever.language-x86-64-assembly"
vscode "aaronyoung.dark-synthwave-vscode"
vscode "alexowl.transparent-color-theme"
vscode "amankirmara.zenix"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "ankit-aglawe.dusky-glow-theme"
vscode "bahman.vsxcode-themes"
vscode "basdp.language-gas-x86"
vscode "bbenoist.nix"
vscode "be5invis.vscode-custom-css"
vscode "bierner.lit-html"
vscode "bierner.markdown-mermaid"
vscode "blakepark.glassmorphism-themes"
vscode "boyswan.glsl-literal"
vscode "codesandbox-io.codesandbox-projects"
vscode "codezombiech.gitignore"
vscode "colton.inline-html"
vscode "dbcode.dbcode"
vscode "devkir.elixir-syntax-vscode"
vscode "dmitry-korobchenko.prototxt"
vscode "dtsvet.vscode-wasm"
vscode "dustypomerleau.rust-syntax"
vscode "evondev.indent-rainbow-palettes"
vscode "fredrikbakke.agda-syntax"
vscode "geforcelegend.vscode-glsl"
vscode "gimly81.fortran"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "google.geminicodeassist"
vscode "guyskk.language-cython"
vscode "idleberg.applescript"
vscode "illixion.vscode-vibrancy-continued"
vscode "imaginesamurai.glowrays"
vscode "jaakko.black"
vscode "jakebathman.mysql-syntax"
vscode "jeff-hykin.better-c-syntax"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeff-hykin.better-csv-syntax"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jeff-hykin.better-go-syntax"
vscode "jeff-hykin.better-js-syntax"
vscode "jeff-hykin.better-lisp-syntax"
vscode "jeff-hykin.better-objc-syntax"
vscode "jeff-hykin.better-objcpp-syntax"
vscode "jeff-hykin.better-perl-syntax"
vscode "jeff-hykin.better-prolog-syntax"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jeff-hykin.better-syntax"
vscode "jep-a.lua-plus"
vscode "jonwolfe.language-polymer"
vscode "justusadam.language-haskell"
vscode "karunamurti.haml"
vscode "kennethceyer.io"
vscode "krautgti.glass-theme-doyle"
vscode "krebrov.cyberhacker-theme"
vscode "ldez.ignore-files"
vscode "magicstack.magicpython"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "natecrow.stained-glass-theme"
vscode "oscarcs.dart-syntax-highlighting-only"
vscode "pkief.material-icon-theme"
vscode "purecodeai.purecode-ai"
vscode "radium-v.better-less"
vscode "redcmd.tmlanguage-syntax-highlighter"
vscode "sallar.vscode-duotone-dark"
vscode "scala-lang.scala"
vscode "shalldie.background"
vscode "shopify.ruby-lsp"
vscode "sidneys1.gitconfig"
vscode "slevesque.shader"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "toasty-technologies.octave"
vscode "wraith13.background-phi-colors"
vscode "yuce.erlang-otp"
